// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
Console.Clear();
Console.WriteLine("Введите трехзначное число.\n");

void num(int numbers, int count)
{
    while (count -- > 0)
    {
        if (numbers == "2")
        {
            console.writeLine("привет " + numbers + "!");
        }
    else 
        {
        console.writeLine("кто ты" + numbers);
        }
    }
    
}